000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ControlFlow.
000300 AUTHOR. Niels van den Bosch.
000400 ENVIRONMENT DIVISION.
000500 DATA DIVISION.
000600
000700 WORKING-STORAGE SECTION.
000800 01 COUNTER      PIC 9.
000900 01 COUNT-NUMBER PIC 9.
001000
001100 PROCEDURE DIVISION.
001200 PROGRAM-BEGIN.
001300     PERFORM PROGRAM-INITIALIZATION.
001400     PERFORM GET-USER-NUMBER.                                                     
001500     PERFORM DISPLAY-COUNT.                                                     
001600
001700 PROGRAM-DONE.
001800     STOP RUN.
001900
002000 PROGRAM-INITIALIZATION.
002100     MOVE 0 TO COUNTER.
002200
002300 GET-USER-NUMBER.
002400     DISPLAY " ".
002500     DISPLAY "Please enter a number between 2 and 9.".
002600     ACCEPT COUNTER.
002700     DISPLAY " ".
002800
002900 DISPLAY-COUNT.
003000     IF COUNTER > 1 AND COUNTER < 10
003100         DISPLAY "Counting to " COUNTER "."
003200         PERFORM DISPLAY-COUNTING COUNTER TIMES
003300     
003400     ELSE
003500         DISPLAY "You didn't enter a valid number."
003600         PERFORM PROGRAM-DONE.
003700
003800 DISPLAY-COUNTING.
003900     ADD 1 TO COUNT-NUMBER.
004000     IF COUNT-NUMBER < COUNTER + 1
004100         DISPLAY COUNT-NUMBER.
