000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. Decimals.
000300 AUTHOR. Niels van den Bosch.
000400 ENVIRONMENT DIVISION.
000500 DATA DIVISION.
000600 WORKING-STORAGE SECTION.
000700 01 FIRST-NUMBER     PIC S9(4)V9(4) VALUE -10.
000800 01 SECOND-NUMBER    PIC S9(4)V9(4) VALUE 3.
000900 01 ANSWER           PIC -Z(3)9.99.
001000 01 VAR-SIGN         PIC -999.999.
001100
001200 PROCEDURE DIVISION.
001300 PROGRAM-BEGIN.
001400     PERFORM MULTIPLY-NUMBERS.
001500     PERFORM DISPLAY-SIGN.
001600 PROGRAM-DONE.
001700     STOP RUN.
001800
001900 MULTIPLY-NUMBERS.
002000     COMPUTE ANSWER = FIRST-NUMBER * SECOND-NUMBER.
002100     DISPLAY FIRST-NUMBER " * " SECOND-NUMBER " = " ANSWER.
002200
002300 DISPLAY-SIGN.
002400     DISPLAY "Enter a number.".
002500     ACCEPT VAR-SIGN.
002700     DISPLAY VAR-SIGN.
