000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. IfCondition.
000300 AUTHOR. Niels van den Bosch.
000400 ENVIRONMENT DIVISION.
000500 DATA DIVISION.
000600
000700 WORKING-STORAGE SECTION.
000800 01 NUM              PIC 9.
000900 01 USER-LET-ONE     PIC X.
001000 01 USER-LET-TWO     PIC X.
001100
001200 PROCEDURE DIVISION.
001300     
001400 PROGRAM-BEGIN.    
001500     PERFORM INITIALIZE-PROGRAM.
001600     PERFORM GET-INPUT.
001700     PERFORM MAKE-DECISION.
001800
001900 PROGRAM-DONE.
002000     STOP RUN.
002100
002200 INITIALIZE-PROGRAM.
002300     MOVE " " TO USER-LET-ONE.
002400     MOVE " " TO USER-LET-TWO.
002500     MOVE 1 TO NUM.
002600
002700 MAKE-DECISION.
002800
002900     IF USER-LET-ONE < USER-LET-TWO
003000         DISPLAY "Answer is:"
003100         DISPLAY USER-LET-ONE " comes before " USER-LET-TWO
003200         DISPLAY " ".
003300
003400     IF USER-LET-ONE > USER-LET-TWO
003500         DISPLAY "Answer is:"
003600         DISPLAY USER-LET-ONE " comes after " USER-LET-TWO
003700         DISPLAY " ".
003800
003900 GET-INPUT.
004000     DISPLAY "Please enter letter " NUM " (No more than 1 Char.)".                                                    
004100     ACCEPT USER-LET-ONE.
004200     DISPLAY " ".
004300     ADD 1 TO NUM
004400     DISPLAY "Please enter letter " NUM " (No more than 1 Char.)".
004500     ACCEPT USER-LET-TWO.
004600     DISPLAY " ".
004700
004800
