000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. IfElseRange.
000300 AUTHOR. Niels van den Bosch.
000400 ENVIRONMENT DIVISION.
000500 DATA DIVISION.
000600
000700 WORKING-STORAGE SECTION.
000800 01 THE-NUMBER PIC 9(3).
000900
001000 PROCEDURE DIVISION.
001100 PROGRAM-BEGIN.    
001200     PERFORM GET-THE-NUMBER.
001300     PERFORM CHECK-THE-NUMBER.
001400
001500 PROGRAM-DONE.
001600     STOP RUN.
001700
001700 GET-THE-NUMBER.
001800     DISPLAY "Enter a number greater than 10 and less than 100. (1
001900-"1-100)".
002000     ACCEPT THE-NUMBER.
002100 
002000 CHECK-THE-NUMBER.    
002100     IF  THE-NUMBER > 10 AND
002200         THE-NUMBER < 100                                                                  
002300         DISPLAY "The number is in range."                                         
002400     ELSE
002500         DISPLAY "The number is out of range.".
