000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. IfElse.
000300 AUTHOR. Niels van den Bosch.
000400 ENVIRONMENT DIVISION.
000500 DATA DIVISION.
000600
000700 WORKING-STORAGE SECTION.
000800 01 MENU-PICK PIC 9.
000900
001000 PROCEDURE DIVISION.
001100 PROGRAM-BEGIN.    
001200     PERFORM GET-THE-MENU-PICK.
001300     PERFORM DO-THE-MENU-PICK.
001400
001500 PROGRAM-DONE.
001600     STOP RUN.
001700
001700 GET-THE-MENU-PICK.
001800     PERFORM DISPLAY-THE-MENU.
001900     PERFORM GET-THE-PICK.
002000
002100 DO-THE-MENU-PICK.
002000     IF MENU-PICK < 1 OR
002100     MENU-PICK > 3
002200         DISPLAY "Invalid selection".
002300
002400     IF MENU-PICK = 1                                                 
002500         DISPLAY "One for the money.".
002600
002700     IF MENU-PICK = 2
002800         DISPLAY "Two for the show.".
002900
003000     IF MENU-PICK = 3
003100         DISPLAY "Three to get ready.".
003200
003300 DISPLAY-THE-MENU.
003400     DISPLAY "Please enter tge number of the message that you wish
003500-    " to display.".     
003600     DISPLAY " ".
003700     DISPLAY "1. First Message".
003800     DISPLAY "2. Second Message".
003900     DISPLAY "3. Third Message".
004000     DISPLAY " ".
004100     DISPLAY "Your selection (1-3)?".
004200     
004300 GET-THE-PICK.
004400     ACCEPT MENU-PICK.
