000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. Variables. 
000300 AUTHOR. Niels van den Bosch.
000400 ENVIRONMENT DIVISION.
000500 DATA DIVISION.
000600 WORKING-STORAGE SECTION.
000700
000800 01 FIRST-NUMBER PICTURE IS 99.
000900 01 SECOND-NUMBER PIC 99.
001000 01 THE-RESULT PIC 9(3).
001100
001200 PROCEDURE DIVISION.
001300 
001400 PROGRAM-BEGIN.
001500     
001600     DISPLAY "Enter a number.".
001700     
001800     ACCEPT FIRST-NUMBER.
001900
002000     DISPLAY "Enter another number.".
002100
002200     ACCEPT SECOND-NUMBER.
002300
002400     COMPUTE THE-RESULT = FIRST-NUMBER + SECOND-NUMBER.
002500
002600     DISPLAY "The result is:".
002700     DISPLAY THE-RESULT.
002800
002900 PROGRAM-DONE.
003000     STOP RUN.
