000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. Playground.
000300 AUTHOR. Niels van den Bosch.
000400 ENVIRONMENT DIVISION.
000500 DATA DIVISION.
000600
000700 WORKING-STORAGE SECTION.
000800
000900 01 THE-NUMBER PIC 9(4).
001000
001100 PROCEDURE DIVISION.
001200 PROGRAM-BEGIN.
001300     
001400     DISPLAY DIVIDE 15 INTO 3 GIVING C REMAINDER D
001500
001600 PROGRAM-DONE.
001700     STOP RUN.