000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. Variables. 
000300 AUTHOR. Niels van den Bosch.
000400 ENVIRONMENT DIVISION.
000500 DATA DIVISION.
000600 WORKING-STORAGE SECTION.
000700
000800 01 FIRST-NAME PIC x(25).
000900 01 LAST-NAME PIC x(50).
001000
001100 PROCEDURE DIVISION.                                              
001200 
001300 PROGRAM-BEGIN.
001400     
001500     DISPLAY "Enter your first name.".
001600     
001700     ACCEPT FIRST-NAME.
001800
001900     DISPLAY "Enter your last name.".
002000
002100     ACCEPT LAST-NAME.
002200
002300     DISPLAY "Your name is:".
002400     DISPLAY FUNCTION CONCATENATE(
002500         FUNCTION TRIM(FIRST-NAME); SPACE;
002600         FUNCTION TRIM(LAST-NAME)).
002700
002800 PROGRAM-DONE.
002900     STOP RUN.
