000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. Tables.
000300 AUTHOR. Niels van den Bosch.
000400 ENVIRONMENT DIVISION.
000500 DATA DIVISION.
000600 WORKING-STORAGE SECTION.
000700 01 TABLE-OF-NAMES.
000800     05 THE-ID       PIC 99   VALUE ZEROES.
000900     05 FILLER       PIC X       VALUE SPACE.                    
001000     05 COLUMN-HEADER.                    
001100         10 FIRST-NAME   PIC X(10)   VALUE SPACES.
001200         10 LAST-NAME    PIC X(15)   VALUE SPACES.
001300
001400 PROCEDURE DIVISION.
001500 PROGRAM-BEGIN.
001600     MOVE 1 TO THE-ID.
001700     MOVE "Niels"            TO FIRST-NAME.
001800     MOVE "van den Bosch"    TO LAST-NAME.
001900*    DISPLAY TABLE-OF-NAMES.
002000
002100     ADD 1 TO THE-ID.
002200     MOVE "Marinda"          TO FIRST-NAME.
002300     MOVE "Scheerman"        TO LAST-NAME.
002400     DISPLAY TABLE-OF-NAMES.
002500
002600 PROGRAM-DONE.
002700     STOP RUN.
