000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. TheMoveVerb.
000300 AUTHOR. Niels van den Bosch.
000400 ENVIRONMENT DIVISION.
000500 DATA DIVISION.                                                   
000600 WORKING-STORAGE SECTION.
000700
000800 01 A-GREATING   PIC X(10).
000900 01 A-NAME       PIC X(6).
001000 01 A-NUMBER     PIC 9(2).
001100
000120 PROCEDURE DIVISION.                                              
001300
001400 PROGRAM-BEGIN. 
001500
001600     DISPLAY "Enter your name.".
001700
001800     ACCEPT A-NAME.
001900
002000     MOVE "Hello" TO A-GREATING.
002100     MOVE 1 TO A-NUMBER.
002200
002300     DISPLAY FUNCTION CONCATENATE(
002500                 FUNCTION TRIM(A-GREATING); SPACE;
002600                 FUNCTION TRIM(A-NAME); "." SPACE;
002700                 FUNCTION TRIM(A-NUMBER); " is a number.").
002800
002900     MOVE "Welcome" TO A-GREATING.
003000     MOVE 2 TO A-NUMBER.
003100
003200     DISPLAY FUNCTION CONCATENATE(
003300                 FUNCTION TRIM(A-GREATING); SPACE;
003400                 FUNCTION TRIM(A-NAME); "." SPACE;
003500                 FUNCTION TRIM(A-NUMBER); " is a number.").
003600
003700 PROGRAM-DONE.
003800     STOP RUN.                                                    
