000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ThePerfomVerb.
000300 AUTHOR. Niels van den Bosch.
000400 ENVIRONMENT DIVISION.                                             
000500 DATA DIVISION.
000600 PROCEDURE DIVISION.
000700 
000800 PROGRAM-BEGIN.
000900     DISPLAY "Today's message is:".                                   
001000     PERFORM SAY-HELLO.
001100     DISPLAY "I have bounced back".
001200
001300 PROGRAM-DONE.
001400     STOP RUN.
001500
001600 SAY-HELLO.
001700     DISPLAY "Hello World!".
