000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. TimesTable.
000300 AUTHOR. Niels van den Bosch.
000400 ENVIRONMENT DIVISION.
000500 DATA DIVISION.
000600 WORKING-STORAGE SECTION.
000700     01 A-TABLE          PIC 99.
000800     01 START-OF-RANGE   PIC 99.
000900     01 END-OF-RANGE     PIC 999.
001000     01 TRIMMED-TABLE    PIC Z9.
001100     01 TRIMMED-START    PIC Z9.
001200     01 TRIMMED-END      PIC Z9.
001300     01 THE-RESULT       PIC ZZ9.
001400
001500     01 ANSWER           PIC X(3).
001600 PROCEDURE DIVISION.
001700 PROGRAM-BEGIN.
001800     PERFORM GET-USER-INPUT-TABLE.
001900     PERFORM GET-USER-INPUT-START.
002000     PERFORM GET-USER-INPUT-END.
002100     PERFORM DISPLAY-TABLE.
002200
002300     PERFORM GO-AGAIN.
002400
002500 PROGRAM-DONE.
002600     STOP RUN.
002700
002800 GET-USER-INPUT-TABLE.                                                  
002900     DISPLAY "Please use positive integers only.".
003000     DISPLAY "Enter multiplication table between 1 and 12.". 
003100     ACCEPT  A-TABLE.
003200     PERFORM CHECK-INPUT-TABLE.
003300
003400 GET-USER-INPUT-START.
003500     DISPLAY "Enter start of range.".
003600     ACCEPT  START-OF-RANGE.
003700     PERFORM CHECK-INPUT-START.                                    
003800
003900 GET-USER-INPUT-END.
004000     DISPLAY "Enter end of range.".
004100     ACCEPT  END-OF-RANGE.
004200     PERFORM CHECK-INPUT-END.                            
004300
004400 CHECK-INPUT-TABLE.
004500     IF A-TABLE < 1 OR A-TABLE > 12
004600         DISPLAY "Error! Please enter a legal integer."
004700         DISPLAY "Enter a times table between 1 and 12."
004800         DISPLAY " "
004900         PERFORM GET-USER-INPUT-TABLE
005000     ELSE
005100         MOVE    A-TABLE TO TRIMMED-TABLE.                                   
005200
005300 CHECK-INPUT-START.
005400     IF START-OF-RANGE < 1 OR START-OF-RANGE > 12                    
005500         DISPLAY "Error! Please enter a positive integer smaller t
005600-    "han 12."
005700         DISPLAY " "                                 
005800         PERFORM GET-USER-INPUT-START
005900     ELSE
006000         MOVE    START-OF-RANGE TO TRIMMED-START.
006100
006200 CHECK-INPUT-END.
006300     IF END-OF-RANGE < START-OF-RANGE + 1 OR END-OF-RANGE > 100
006400         DISPLAY "Error! Please enter a legal integer greater than
006500-    " " TRIMMED-START " and less than 100."
006600         DISPLAY " "
006700         PERFORM GET-USER-INPUT-END
006800     ELSE
006900         MOVE END-OF-RANGE TO TRIMMED-END.
007000
007100 DISPLAY-TABLE.
007200     DISPLAY "Times table is " TRIMMED-TABLE " between " 
007300             TRIMMED-START " and " TRIMMED-END.
007400     PERFORM CALCULATE-TABLE
007500         VARYING START-OF-RANGE FROM START-OF-RANGE BY 1
007600         UNTIL START-OF-RANGE > END-OF-RANGE.
007700
007800 CALCULATE-TABLE.
007900     MOVE    START-OF-RANGE TO TRIMMED-START.                                        
008000     COMPUTE THE-RESULT = START-OF-RANGE * A-TABLE.
008100     DISPLAY TRIMMED-START " * " TRIMMED-TABLE " = " THE-RESULT.
008200
008300 GO-AGAIN.
008400     DISPLAY "Would you like to do another table? (yes/no)".
008500     ACCEPT  ANSWER.
008600     IF ANSWER = "yes"
008700         PERFORM PROGRAM-BEGIN.
008900     IF ANSWER = "no"
009000         DISPLAY "Goodbye!"
009100         PERFORM PROGRAM-DONE
009200     ELSE
009300         DISPLAY "Error! Please enter yes or no."
009400         PERFORM GO-AGAIN.
