000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. FizzBuzz.
000300 AUTHOR. Niels van den Bosch.
000400 ENVIRONMENT DIVISION.
000500 DATA DIVISION.
000600
000700 WORKING-STORAGE SECTION.
000800
000900 01 THE-NUMBER           PIC 9(4).
001000 01 BY-THREE-RESULT      PIC 9(2).
001100 01 BY-THREE-REMAINDER   PIC 9(2).
001200 01 BY-FIVE-RESULT       PIC 9(2).
001300 01 BY-FIVE-REMAINDER    PIC 9(2).
001400
001500 PROCEDURE DIVISION.
001600 PROGRAM-BEGIN.
001700     PERFORM GET-THE-NUMBER.
001800     PERFORM CALCULATE-THREE.                                                     
001900     PERFORM CALCULATE-FIVE.                                                     
002000     PERFORM DISPLAY-RESULT.
002100
002200 PROGRAM-DONE.
002300     STOP RUN.
002400
002500 GET-THE-NUMBER.
002600     DISPLAY "Please enter a number greater than 0.".
002700     ACCEPT THE-NUMBER.
002800 
002900 CALCULATE-THREE.
003000     DIVIDE THE-NUMBER BY 3 
003100     GIVING BY-THREE-RESULT REMAINDER BY-THREE-REMAINDER.
003200 
003300 CALCULATE-FIVE.
003400     DIVIDE THE-NUMBER BY 5 
003500     GIVING BY-FIVE-RESULT REMAINDER BY-FIVE-REMAINDER.
003600
003700 DISPLAY-RESULT.
003800     IF  BY-THREE-REMAINDER = BY-FIVE-REMAINDER
003900             DISPLAY "FizzBuzz".
004000
004100     IF BY-THREE-REMAINDER = 0
004200             DISPLAY "Fizz"
004300
004400     IF BY-FIVE-REMAINDER = 0
004500             DISPLAY "Buzz"
004600
004700     ELSE
004800             DISPLAY " ".
